<?php
/**
 * ru
 * for /Auth/signup
 */

return [
    'Регистрация'           => 'Реєстрація',
    'Желательное поле'      => 'Бажане поле&#10;(якщо не вказати, то буде сформовано автоматично)',
    'login для авторизации' => 'Login для авторизації. &#10;Якщо не вказати, то буде використано ID поля з бази. &#10;Пізніше його можна буде змінити.',
    'Обюязательное поле'    => 'Обов\'язкове поле',
    'Тел'                   => 'Тел',
    'Обращение'             => 'Звернення',
    'Краткое имя'           => 'Коротке ім\'я (звернення)',
    'Полное имя'            => 'Повне ім\'я (П.І.Б.)',
    'Эл. почта'             => 'Ел. пошта',
    'Зарегистрировать'      => 'Зареєструвати',

];
