<?php
/**
 * uk
 * for /Auth/signup
 */

return [

    'Registration' => 'Реєстрація',
    'Desired field' => 'Бажане поле&#10;(якщо не вказати, то буде сформовано автоматично)',
    'Name for authorization' => 'Ім\'я для авторизації. &#10;Якщо не вказати, то буде використано ID поля з бази. &#10;Пізніше його можна буде змінити.',
    'Required field' => 'Обов\'язкове поле',
    'Phone number' => 'Телефонний номер',
    'Appeal' => 'Звернення',
    'Short name' => 'Коротке ім\'я (звернення)',
    'Full name' => 'Повне ім\'я (П.І.Б.)',
    'Email' => 'Ел. пошта',
    'Register' => 'Зареєструвати',

];
