<?php
/**
 * ru
 * for /Auth/signup
 */

return [

    'Registration' => 'Регистрация',
    'Desired field' => 'Желательное поле&#10;(если не указать, то будет сформировано автоматически)',
    'Name for authorization' => 'Имя для авторизации. &#10;Если не указать, то будет использован ID поля из базы. &#10;Позже его можно будет сменить.',
    'Required field' => 'Обязательное поле',
    'Phone number' => 'Телефонный номер',
    'Appeal' => 'Обращение',
    'Short name' => 'Краткое имя (обращение)',
    'Full name' => 'Полное имя (Ф.И.О.)',
    'Email' => 'Эл. почта',
    'Register' => 'Зарегистрировать',

];
