<?php
/**
 * ru
 * for /Auth/signup
 */

return [
    'Регистрация'           => 'Регистрация',
    'Желательное поле'      => 'Желательное поле&#10;(если не указать, то будет сформировано автоматически)',
    'login для авторизации' => 'login для авторизации. &#10;Если не указать, то будет использован ID поля из базы. &#10;Позже его можно будет сменить.',
    'Обюязательное поле'    => 'Обюязательное поле',
    'Тел'                   => 'Тел',
    'Обращение'             => 'Обращение',
    'Краткое имя'           => 'Краткое имя (обращение)',
    'Полное имя'            => 'Полное имя (Ф.И.О.)',
    'Эл. почта'             => 'Эл. почта',
    'Зарегистрировать'      => 'Зарегистрировать',

];
